// จงสร้างโปรแกรมที่ใช้ console.log เพื่อแสดงผลตัวเลขทั้งหมดตั้งแต่ 1 - 100 ด้วยเงื่อนไขดังนี้
// 1. ถ้าตัวเลขนั้นสามารถหารด้วย 3 ลงตัวให้แสดงผลคำว่า "Fizz"
// 2. ถ้าตัวเลขนั้นสามารถหารด้วย 5 ลงตัว(หารด้วย 3 ไม่ลงตัว) ให้แสดงผลคำว่า "Buzz"
// แล้วถ้าโปรแกรมของคุณใช้งานได้แล้ว ให้ดัดแปลงมันอีกนิดหน่อย โดยให้เลขที่หารด้วยทั้ง 3 และ 5 ลงตัวแสดงผลคำว่า "FizzBuzz"(แต่ก็ยังสามารถแสดงผล "Fiz​z" และ "Buzz" ได้ปกติตามเงื่อนไขข้อ 1 และ 2) ยกตัวอย่างผลลัพธ์ดังภาพ

for (i=1; i<=100; i++) {
    if (i%3 == 0 && i%5 == 0) console.log("fizzbuzz");
    else if (i%3 == 0) console.log("fizz");
    else if (i%5 == 0) console.log("buzz");
    else console.log(i);
}